"Shoppersstop and other companies are looking for candidates like you Hi Neeraj Sati, We have here a list of the top jobs recommended especially for you! Department Manager Shoppersstop Chandigarh    |    2-5 yrs Skills: Self-motivated, and, confident. APPLY Receptionist Mansys Consulting Services |    1-5 yrs Skills: Receptionist APPLY Techno Functional Consultant - Finance Module Eygbs (India) LLP Multiple Cities    |    3-6 yrs Skills: Techno Functional Consultant, S4 Hana, Oracle Fusion, Functional... APPLY Process Automation commissioning Engineer HuPerp Management and Consultancy Services LLP Bengaluru / Bangalore    |    0-0 yrs Skills: Relays, Motors, Control Systems, electrical calculations, Plc, S... APPLY ARE THESE JOBS RELEVANT? NO YES Java+AWS /Java +Microservices+Docker Confidential Bengaluru / Bangalore    |    8-12 yrs Skills: Java, aws, Microservices, Docker APPLY Sterilization Technician Lancesoft India Private Limited Goa    |    0-3 yrs Skills: Sterilization Technician, Technician APPLY Executives EXL IT service management Noida    |    0-8 yrs Skills: English Communication, Reading Comprehension APPLY AR Caller medical billing Matrix Hr Technologies Private Limited Multiple Cities    |    1-5 yrs Skills: Medical Billing, Ar Caller, Us Healthcare, Healthcare, Physicians APPLY Business Analyst+ Product Owner Excellence And Eminence LLP Multiple Cities    |    5-7 yrs Skills: Key Skills: UI/UX, Development/Testing in Web/Mobile App, Agile/... APPLY Assessment Expert || Bangalore Foundit (Formerly Monster) Bengaluru / Bangalore    |    6-12 yrs Skills: Assessment Design\", \"Assessment Designing\", \"Assessment Developm... APPLY JOB PROFILE 29% Profile Score (Your Designation) UPDATE Have you heard? Profiles with 100% completion scores get 3X the visibility, and your current profile score is 29%. Have a great day and good luck! Team foundit (Formerly Monster) Beware of fake job postings that get listed online from time to time and ask for your personal information illegally. Do not pay any money to anyone who promises to find you a job. foundit shall not have any responsibility in this regard. Download App You have received this mail because your e-mail address is registered with www.foundit.in. Please do not reply to this mail, as this is a system-generated communication sent to you based on your job preferences on foundit. We have enabled an auto-login facility for your convenience to ensure that your job searches and application experience are smoother and faster. We recommend you do NOT forward this e-mail to protect your foundit account from unauthorized access/misuse. Although, foundit has adopted the required feasible measures to ensure that the information provided is authentic. However, we strongly recommend you verify the authenticity of the information. foundit also advises users to beware of any fraudulent communication asking for personal /banking information or seeking money for any job offer. foundit does NOT authorize any agency/partner to collect any fees for job offers. Report any such suspicious activity to: spam@foundit.in or info@foundit.in. Please note in no event shall foundit be liable for any damages whatsoever. We also recommend you visit the \"Terms of Use\" and \"Privacy Policy\" sections of the foundit website for more details. Have a question? E-mail at info@foundit.in Beware of fake job postings that get listed online from time to time and require you to share your personal information. copyright emoji 2022 All rights reserved."