" Hi Neeraj Sati, Welcome to your Daily Groww Digest. Groww Digest Daily  9 Dec 2022 Sensex  62,181.67 ▼ 0.62% Nifty  18,496.60  ▼ 0.61% 💡 Fact: Nifty has fallen between 0% and 1% about 416 times in the last 5 years. The markets ended in the red today. IT sector stocks suffered heavily. Similarly, stocks from most other sectors also ended lower. Top Gainers (Nifty 50) Nestle Rs 20,241.75 ▲ 2.20% Titan Rs 2,615.45 ▲ 1.24% Sun Pharma Rs 992.85 ▲ 1.23% Dr Reddy's Rs 4,407.10 ▲ 1.17% Eicher Motors Rs 3,358.20 ▲ 1.08% Top Losers (Nifty 50) HCL Tech Rs 1,027.50 ▼ 6.71% Tech Mahindra Rs 1,035.30 ▼ 3.62% Infosys Rs 1,569.30 ▼ 3.14% Wipro Rs 394.05 ▼ 2.39% Hindalco Rs 462.85 ▼ 1.87% Groww Digest on Telegram: Click here to subscribe. More... +Net inflow in equity mutual funds dropped 76% to Rs 2,258 cr in November as compared to the previous month. Debt funds got a net inflow of Rs 3,668 cr. +Trade deficit (imports - exports) between India and China touched USD 51.5 billion in April-October 2022. +20 Indian companies rank among the 500 most-valuable ones in the world. Reliance is the most valued Indian company: Hurun report. Other stocks in the news V-Guard: will acquire Sunflame Enterprises for Rs 660 cr. Lupin: launched joint pain drug in the US market. Marico: will buy Vietnam-based personal care firm Beauty X Corporation for Rs 172 cr. Alembic Pharma: received approval from USFDA for marketing a skin treatment cream. SBI: board will consider fundraising on Dec 14. Bajaj Consumer Care: announced a buyback of shares at Rs 240 per share. 1 Day Change Gold: Rs 54,316 ▲ 0.42% - at 6 PM Silver: Rs 67,298 ▲ 1.25% - at 6 PM   USD-INR: Rs 82.27/USD ▼ 0.18% Dow Jones: 33,781.48 ▲ 0.55% - 8 Dec Nasdaq: 11,082.00 ▲ 1.13% - 8 Dec  A fall in the USD INR rate indicates that the Rupee is getting stronger as compared to the US dollar, hence it is presented in green. A rise represents weakening of the Rupee as compared to the US dollar, hence it is shown in red. Long Term: 20-Year Returns   Sensex:  15.88% p.a. Nifty:  15.38% p.a. Dow Jones:  7.16% p.a. Nasdaq:  10.97% p.a.  Returns in INR for Sensex & Nifty and in USD for Dow Jones & Nasdaq - not directly comparable . Federal Reserve Word of the Day The Federal Reserve or US Fed is the central bank of US. It is responsible for setting key rates in the country - to control inflation and employment. Because of the immense size of the US economy, any step taken by the US Fed has an indirect impact on other countries as well. 6 Day Course Theme: ways of categorising stocks Day 5: Friday Cyclical and non-cyclical stocks. Certain parts of any country’s economy and even the entire globe’s economy operates in cycles of ups and downs. Stocks of companies that are directly affected by such cycles are called cyclical stocks. Example: fertiliser stocks. The stocks often tend to do better before and during the rainy season every year. On the other hand, there are non-cyclical stocks. These are more evergreen in nature. Example: FMCG stocks are usually a lot less affected by small economic cycles. Missed last week's course? You can downloa d the course PDF - click to download .  Featured Question \"how to find out whether my mf are open ended or close ended?\" These details can be found written in the mutual funds’ scheme information document. Various mutual fund platforms allow you to read and even download this document. You can download this document on Groww from the mutual funds’ page itself. If not, you can always visit the website of the mutual fund company itself and download the document from there. ------------------ In this section, daily, we'll try to answer one burning question related to the field of personal finance education.  Remember, NO investment advice & ONLY personal finance education questions.  Ask your question here: Ask a question Did you enjoy this issue? Investing made simple  Team Groww Digest Disclaimer: The above-mentioned details have been collated/prepared by Nextbillion Technology Pvt Ltd and is meant for sole use by the recipient and not for circulation. The information contained in this e-mailer has not been prepared to take into account specific investment objectives, financial situations, or needs of any particular investor and is only intended for general information purposes only. The information published should not be used as a substitute for any form of an investment advertisement, investment advice, or investment information. Kindly note that investment in securities markets is subject to market risks, read all the related documents carefully before investing. The investor is requested to take into consideration all the risk factors before the commencement of trading. Mutual Fund investments are subject to market risks, read all scheme related documents carefully. Past performance of the schemes is neither an indicator nor a guarantee of future performance. Nextbillion Technology Pvt Ltd - SEBI Registration no: INZ000301838, DPI Registration no: IN-DP-417-2019 and AMFI Registration No: ARN-111686 To get the latest updates on investing and personal finance, subscribe to us on  Youtube ,  Facebook ,  Twitter ,  Linkedin and Instagram . ⓒ 2020 Nextbillion Technology Pvt Ltd About Us  |  Terms & Conditions  |  Privacy Policy No.11, 80 Feet Road, 4th Block, S.T Bed, Koramangala, Bangalore – 560034, Karnataka This is an auto-generated email. You received this email because you are subscribed to Groww. If you don't want to hear from us,  click here . Need assistance? visit our help center . "